In [79]:
import numpy as np
import pandas as pd


# QUESTION 1 - newdatabasescenario
# FIRST DATASET

df = pd.read_csv("employee_data.csv")

In [80]:
rows = df.shape[0]
print(rows)

15

In [81]:
missing = df.isnull()
print(missing)

    Employee_ID    Age  Department  Job_Role  Monthly_Income  \
0         False  False       False     False           False
1         False  False       False     False           False
2         False  False       False     False           False
3         False  False       False     False           False
4         False  False       False     False           False
5         False  False       False     False           False
6         False  False       False     False           False
7         False  False       False     False           False
8         False  False       False     False           False
9         False  False       False     False           False
10        False  False       False     False           False
11        False  False       False     False           False
12        False  False       False     False           False
13        False  False       False     False           False
14        False  False       False     False           False

    Years_at_Company  Overtime  Job_Satisfaction  Attrition
0              False     False             False      False
1              False     False             False      False
2              False     False             False      False
3              False     False             False      False
4              False     False             False      False
5              False     False             False      False
6              False     False             False      False
7              False     False             False      False
8              False     False             False      False
9              False     False              True      False
10             False     False             False      False
11             False     False             False      False
12             False     False             False      False
13             False     False             False      False
14             False     False             False      False

In [82]:
avg = df["Monthly_Income"].mean()
print(avg)

56533.333333333336

In [83]:
max = df["Monthly_Income"].max()
print(max)

85000

In [84]:
min = df["Monthly_Income"].min()
print(min)

45000

In [85]:
missing = df.isnull().sum()
print(missing)

Employee_ID         0
Age                 0
Department          0
Job_Role            0
Monthly_Income      0
Years_at_Company    0
Overtime            0
Job_Satisfaction    1
Attrition           0
dtype: int64

In [86]:
df.head()

,Employee_ID,Age,Department,Job_Role,Monthly_Income,Years_at_Company,Overtime,Job_Satisfaction,Attrition
0,E001,29,Sales,Sales Executive,45000,3,Yes,4.0,No
1,E002,35,HR,HR Manager,52000,7,No,3.0,No
2,E003,28,IT,Software Engineer,60000,2,Yes,2.0,Yes
3,E004,42,Finance,Accountant,58000,10,No,4.0,No
4,E005,31,Sales,Sales Executive,47000,4,Yes,3.0,Yes

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee_ID       15 non-null     object
 1   Age               15 non-null     int64
 2   Department        15 non-null     object
 3   Job_Role          15 non-null     object
 4   Monthly_Income    15 non-null     int64
 5   Years_at_Company  15 non-null     int64
 6   Overtime          15 non-null     object
 7   Job_Satisfaction  14 non-null     float64
 8   Attrition         15 non-null     object
dtypes: float64(1), int64(3), object(5)
memory usage: 1.2+ KB

In [88]:
df.describe()

             Age  Monthly_Income  Years_at_Company  Job_Satisfaction
count  15.000000       15.000000         15.000000         14.000000
mean   32.733333    56533.333333          4.800000          3.285714
std     5.599320    11057.425861          2.908117          0.913874
min    24.000000    45000.000000          1.000000          2.000000
25%    28.500000    48500.000000          2.500000          3.000000
50%    32.000000    54000.000000          4.000000          3.000000
75%    37.000000    60000.000000          7.000000          4.000000
max    42.000000    85000.000000         10.000000          5.000000

In [89]:
df.dtypes

Employee_ID          object
Age                   int64
Department           object
Job_Role             object
Monthly_Income        int64
Years_at_Company      int64
Overtime             object
Job_Satisfaction    float64
Attrition            object
dtype: object

In [90]:
salary_attrition = df.groupby('Attrition')['Monthly_Income'].mean()
salary_attrition

Attrition
No     59111.111111
Yes    52666.666667
Name: Monthly_Income, dtype: float64

In [91]:
salary_attrition = df.groupby('Department')['Monthly_Income'].mean()
print(salary_attrition)

Department
Finance    56333.333333
HR         49000.000000
IT         63200.000000
Sales      54000.000000
Name: Monthly_Income, dtype: float64

In [92]:
df.tail()

,Employee_ID,Age,Department,Job_Role,Monthly_Income,Years_at_Company,Overtime,Job_Satisfaction,Attrition
10,E011,36,IT,Data Scientist,85000,5,No,5.0,No
11,E012,41,Sales,Sales Executive,49000,9,Yes,3.0,Yes
12,E013,24,IT,Software Engineer,54000,1,Yes,2.0,Yes
13,E014,38,Finance,Accountant,60000,7,No,4.0,No
14,E015,32,HR,HR Executive,47000,4,No,3.0,No

In [93]:
income_array = df['Monthly_Income'].to_numpy()
income_array

array([45000, 52000, 60000, 58000, 47000, 55000, 48000, 62000, 75000,
       51000, 85000, 49000, 54000, 60000, 47000])

In [94]:
np.mean(income_array)

np.float64(56533.333333333336)

In [95]:
np.median(income_array)

np.float64(54000.0)

In [96]:
round(np.std(income_array) , 3)

np.float64(10682.488)

In [97]:
# SECOND DATASET

df = pd.read_csv("telcom_data.csv")

In [98]:
rows = df.shape[0]
print(rows)

15

In [99]:
missing = df.isnull()
print(missing)

    Customer_ID  Gender    Age  Tenure_Months  Monthly_Charges  Contract_Type  \
0         False   False  False          False            False          False
1         False   False  False          False            False          False
2         False   False  False          False            False          False
3         False   False  False          False            False          False
4         False   False  False          False            False          False
5         False   False  False          False            False          False
6         False   False  False          False            False          False
7         False   False  False          False            False          False
8         False   False  False          False            False          False
9         False   False  False          False            False          False
10        False   False  False          False            False          False
11        False   False  False          False            False          False
12        False   False  False          False            False          False
13        False   False  False          False            False          False
14        False   False  False          False            False          False

    Internet_Service  Payment_Method  Churn
0              False           False  False
1              False           False  False
2              False           False  False
3              False           False  False
4              False           False  False
5              False           False  False
6              False           False  False
7              False           False  False
8              False           False  False
9              False           False  False
10             False           False  False
11             False           False  False
12             False           False  False
13             False           False  False
14             False           False   True

In [100]:
avg = df["Monthly_Charges"].mean()
print(avg)

702.6666666666666

In [101]:
max = df["Monthly_Charges"].max()
print(max)

900

In [102]:
min = df["Monthly_Charges"].min()
print(min)

480

In [103]:
missing = df.isnull().sum()
print(missing)

Customer_ID         0
Gender              0
Age                 0
Tenure_Months       0
Monthly_Charges     0
Contract_Type       0
Internet_Service    0
Payment_Method      0
Churn               1
dtype: int64

In [104]:
df.head()

,Customer_ID,Gender,Age,Tenure_Months,Monthly_Charges,Contract_Type,Internet_Service,Payment_Method,Churn
0,C001,Male,25,6,500,Month-to-Month,Fiber Optic,Credit Card,Yes
1,C002,Female,34,24,750,One Year,DSL,Bank Transfer,No
2,C003,Male,45,36,820,Two Year,Fiber Optic,Credit Card,No
3,C004,Female,29,3,600,Month-to-Month,DSL,Electronic Check,Yes
4,C005,Male,52,60,900,Two Year,Fiber Optic,Bank Transfer,No

In [105]:
df.describe()

             Age  Tenure_Months  Monthly_Charges
count  15.000000      15.000000        15.000000
mean   35.266667      22.533333       702.666667
std     8.539544      19.397594       140.023807
min    23.000000       2.000000       480.000000
25%    28.500000       5.500000       595.000000
50%    34.000000      18.000000       720.000000
75%    40.500000      33.000000       815.000000
max    52.000000      60.000000       900.000000

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_ID       15 non-null     object
 1   Gender            15 non-null     object
 2   Age               15 non-null     int64
 3   Tenure_Months     15 non-null     int64
 4   Monthly_Charges   15 non-null     int64
 5   Contract_Type     15 non-null     object
 6   Internet_Service  15 non-null     object
 7   Payment_Method    15 non-null     object
 8   Churn             14 non-null     object
dtypes: int64(3), object(6)
memory usage: 1.2+ KB

In [107]:
df.dtypes

Customer_ID         object
Gender              object
Age                  int64
Tenure_Months        int64
Monthly_Charges      int64
Contract_Type       object
Internet_Service    object
Payment_Method      object
Churn               object
dtype: object

In [108]:
salary_attrition = df.groupby('Payment_Method')['Monthly_Charges'].mean()
salary_attrition

Payment_Method
Bank Transfer       838.000000
Credit Card         651.666667
Electronic Check    610.000000
Name: Monthly_Charges, dtype: float64

In [109]:
salary_attrition = df.groupby('Internet_Service')['Monthly_Charges'].mean()
salary_attrition

Internet_Service
DSL            732.857143
Fiber Optic    676.250000
Name: Monthly_Charges, dtype: float64

In [110]:
df.tail()

,Customer_ID,Gender,Age,Tenure_Months,Monthly_Charges,Contract_Type,Internet_Service,Payment_Method,Churn
10,C011,Male,33,15,700,One Year,Fiber Optic,Credit Card,No
11,C012,Female,46,55,880,Two Year,DSL,Bank Transfer,No
12,C013,Male,26,5,520,Month-to-Month,Fiber Optic,Credit Card,Yes
13,C014,Female,39,30,810,One Year,DSL,Bank Transfer,No
14,C015,Male,41,20,770,One Year,Fiber Optic,Electronic Check,NaN

In [111]:
income_array = df['Monthly_Charges'].to_numpy()
income_array

array([500, 750, 820, 600, 900, 650, 480, 850, 720, 590, 700, 880, 520,
       810, 770])

In [112]:
np.mean(income_array)

np.float64(702.6666666666666)

In [113]:
np.median(income_array)

np.float64(720.0)

In [114]:
round(np.std(income_array) , 3)

np.float64(135.276)

In [115]:
# THIRD DATASET


df = pd.read_csv("sample_data.csv")

In [116]:
rows = df.shape[0]
print(rows)

15

In [117]:
missing = df.isnull()
print(missing)

    Employee_ID  Department  Region  Salary  Experience_Years  \
0         False       False   False   False             False
1         False       False   False   False             False
2         False       False   False   False             False
3         False       False   False   False             False
4         False       False   False   False             False
5         False       False   False   False             False
6         False       False   False   False             False
7         False       False   False   False             False
8         False       False   False   False             False
9         False       False   False   False             False
10        False       False   False   False             False
11        False       False   False   False             False
12        False       False   False   False             False
13        False       False   False   False             False
14        False       False   False   False             False

    Performance_Rating  Monthly_Sales
0                False          False
1                False          False
2                False          False
3                False          False
4                False          False
5                False          False
6                False          False
7                False          False
8                False          False
9                False          False
10               False          False
11                True          False
12               False           True
13               False          False
14               False          False

In [118]:
avg = df["Salary"].mean()
print(avg)

49666.666666666664

In [120]:
max = df["Salary"].max()
print(max)

62000

In [121]:
min = df["Salary"].min()
print(min)

39000

In [122]:
missing = df.isnull().sum()
print(missing)

Employee_ID           0
Department            0
Region                0
Salary                0
Experience_Years      0
Performance_Rating    1
Monthly_Sales         1
dtype: int64

In [123]:
df.head()

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
0,1001,Sales,North,45000,2,4.0,120000.0
1,1002,Marketing,South,52000,3,3.0,98000.0
2,1003,Sales,East,47000,4,5.0,150000.0
3,1004,HR,West,40000,1,3.0,0.0
4,1005,IT,North,60000,5,4.0,0.0

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         15 non-null     int64
 1   Department          15 non-null     object
 2   Region              15 non-null     object
 3   Salary              15 non-null     int64
 4   Experience_Years    15 non-null     int64
 5   Performance_Rating  14 non-null     float64
 6   Monthly_Sales       14 non-null     float64
dtypes: float64(2), int64(3), object(2)
memory usage: 972.0+ bytes

In [125]:
df.describe()

,Employee_ID,Salary,Experience_Years,Performance_Rating,Monthly_Sales
count,15.000000,15.000000,15.000000,14.000000,14.000000
mean,1008.000000,49666.666667,3.200000,3.785714,76928.571429
std,4.472136,7158.079019,1.373213,0.892582,62039.025293
min,1001.000000,39000.000000,1.000000,2.000000,0.000000
25%,1004.500000,45500.000000,2.000000,3.000000,0.000000
50%,1008.000000,49000.000000,3.000000,4.000000,95000.000000
75%,1011.500000,52500.000000,4.000000,4.000000,128750.000000
max,1015.000000,62000.000000,6.000000,5.000000,150000.000000

In [126]:
df.tail()

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
10,1011,Sales,East,50000,4,5.0,140000.0
11,1012,Marketing,West,53000,3,NaN,92000.0
12,1013,IT,North,61000,5,4.0,NaN
13,1014,Sales,South,49000,3,4.0,135000.0
14,1015,HR,East,42000,2,3.0,0.0

In [127]:
df.dtypes

Employee_ID             int64
Department             object
Region                 object
Salary                  int64
Experience_Years        int64
Performance_Rating    float64
Monthly_Sales         float64
dtype: object

In [128]:
salary_attrition = df.groupby('Department')['Salary'].mean()
salary_attrition

Department
HR           40333.333333
IT           61000.000000
Marketing    52000.000000
Sales        47500.000000
Name: Salary, dtype: float64

In [129]:
salary_attrition = df.groupby('Region')['Salary'].mean()
salary_attrition

Region
East     47500.000000
North    53000.000000
South    47000.000000
West     51666.666667
Name: Salary, dtype: float64

In [130]:
income_array = df['Salary'].to_numpy()
income_array

array([45000, 52000, 47000, 40000, 60000, 48000, 51000, 62000, 46000,
       39000, 50000, 53000, 61000, 49000, 42000])

In [131]:
np.mean(income_array)

np.float64(49666.666666666664)

In [132]:
np.median(income_array)

np.float64(49000.0)

In [133]:
np.std(income_array)

np.float64(6915.361322607968)